#Вариант 1
print("start code")

# Создаем список books с информацией о 5 любимых книгах
books = [
    {
        "title": "Война и мир",
        "author": "Лев Толстой", 
        "year": 1869
    },
    {
        "title": "Дом в котором", 
        "author": "Мариам Петросян",
        "year": 2009
    },
    {
        "title": "Мастер и Маргарита",
        "author": "Михаил Булгаков",
        "year": 1967
    },
    {
        "title": "1984",
        "author": "Джордж Оруэлл", 
        "year": 1949
    },
    {
        "title": "Преступление и наказание",
        "author": "Федор Достоевский",
        "year": 1866
    }
]
# Выводим информацию о каждой книге
for i, book in enumerate(books, 1):
    print(f" ---------- Книга {i} ----------")
    print(f" Название: {book['title']}, Автор: {book['author']}, ")
    print(f" -------------{book['year']} ------------ ")
print("end")
